[
    {
        "name": "Debbie",
        "property": "FLOW Casita",
        "experience": "The location was perfect. The home comfortable and clean. The management company responsive and kind. We felt welcomed, safe, and comfortable in our surroundings and would recommend Flow to anyone traveling to Nosara! We used the private chef service while there and he did an awesome job."
    },
    {
        "name": "Annette",
        "property": "FLOW Villa O",
        "experience": "We’ve stayed at the bungalow twice so far and plan to stay every time we come to Nosara. It’s the perfect size, clean, modern, well-thought out, and very convenient. I love that I can see monkeys in the big tree outside of the bathroom window. The pool and outdoor shower and great, and it’s in a quiet location."
    },
    {
        "name": "Matt",
        "property": "FLOW Casita",
        "experience": "Flow Casita was just what we were looking for. Great place to rest-up right on the edge of all the action of Playa Guiones. We had a wonderful stay, slept great, loved the outdoor zone and are looking forward to our next visit!"
    },
    {
        "name": "Paul",
        "property": "Casa Almendra",
        "experience": "Casa Almendra was our home for 10 days and it was perfect! My family (2 kids) split the home with my brother's family (4 kids), and the way the house is designed with two sides was perfect! When you first walk in to the 'complex', it looks exactly as the pictures show. I basically looks ridiculous in the best way. Location wise, it is perfect. Every morning I made coffee and walked to the beach to check the surf. It was that close. We would stay here again in a heartbeat."
    },
    {
        "name": "Jessica",
        "property": "Robins Nest",
        "experience": "Fantastic property in the heart of Nosara. A very short walk to the beach path, leading to Playa Guiones. Also walkable to local shops and dining locations. Very comfortable accommodations, and we thoroughly enjoyed the outdoor shower in the master and the saltwater pool! Kitchen well stocked and AC worked well in all rooms. Beach management staff were very responsive and extremely helpful with questions, booking services at the property, and recommendations for activities!"
    },
    {
        "name": "S.Feldman",
        "property": "Casa Sierra",
        "experience": "What a wonderful property! Casa Sierra is just perfect. The house is fresh, stylish, and totally functional….great room for enjoying, big table for group meals, easy TV for chill time, outdoor surf ‘closet’ and bikes, laundry, comfortable beds, AC and nice ceiling fans, I could go on and on. The house backs up to absolutely stunning jungle, and a nature path that takes you right to town for banana bread at the bakery:) The pool was so enjoyable, and we loved being in the K section of Guiones for its relative quiet and residential feel."
    },
    {
        "name": "Kathryn",
        "property": "Alma del Mar",
        "experience": "Alma del Mar is pure heaven. The house is so well laid out for couples or a family visiting the area. The pool and yard have everything you can imagine. The home is so well stocked with everything you would need to cook, even all your spices and a fabulous grill to throw your local fish onto every evening. The house is very new and so well cared for by the amazing team from Beach Management, Lily, Aliseo, and Noelia. They were thorough, caring and we would trust them with anything, babysitting included! They were there at the drop of a hat for anything we needed."
    },
    {
        "name": "Mary Morketer",
        "property": "Villa Belitza",
        "experience": "The property is beautiful and perfectly located. We had 4 couples stay here for a week and it is perfectly set up for a large family or large group. The bedrooms are set apart from each other for privacy. Each of them are large and comfortable with their own bathrooms. The two kitchens were nice so you could spread out if need be but the best part of the house is the pool area! We spent most of the time outside by the pool enjoying ourselves. Plenty of room in the pool for all of us. Having our own trail to the beach is almost un heard of there so we were lucky to have our own cool little path to head out to the beach."
    },
    {
        "name": "Valentine",
        "property": "Casa Almendra",
        "experience": "Casa almendra was the perfect house for our two families of 9 with 2 teenagers and 3 college students. The design, layout and center pool was fabulous for entertaining and hanging out. The location of the house is within walking distance to the Baker Beach entrance, the Agua Tibia Surfing school, (the best!), and Bode Surf, a super cool hang out eating spot, with a pool and volley ball court. But the best part about the house and our experience in Nosara, was the Management Team. Rick and Grace were outstanding in helping us plan our trip even before we arrived and Grace was amazing at supporting everything we needed during our stay from transportation, to organizing chefs, and being there when things did not go as planned to sort things out."
    },
    {
        "name": "Gian Paolo",
        "property": "Robins Nest",
        "experience": "Amazing house in a beach paradise. A 3-minute walk from a great beach for surfing or just hanging out. Great town and super nice people all around. If you are looking for a beach/jungle experience, this is your place."
    },
    {
        "name": "Sacha",
        "property": "Casa Sierra",
        "experience": "This property was perfect for my family and I. Very elegant house that is stylishly decorated and has comfortable beds and linens. We love having AC in the entire house (vs just in the BR's). The pool was great. Location was perfect (close to everything in Nosara but quiet). I liked having access to bikes to ride down to surf in the AM. I like that the spices and paper goods are plenty stocked by previous travelers. The property management team (Grace) is amazing. Super responsive, organized and helpful."
    },
    {
        "name": "Linda Millard",
        "property": "FLOW Casita",
        "experience": "We had a wonderful stay at Flow. Rick greeted us personally the night we arrived and gave us great tips on places to eat. The villa was beautiful and we really enjoyed the pool especially in the hot afternoons. We were able to walk to the beach and several great restaurants and shops. Didn’t see any monkeys but had a few unique visitors that we enjoyed. We even named them. Fishing trip was a success! Grace was so helpful and always there when we needed her. Thanks to all the Beach management staff"
    },
    {
        "name": "Brook",
        "property": "FLOW Casita",
        "experience": "We had a wonderful stay at Flow Casita. The house was very clean and well cared for which made for a comfortable visit, the linens were fresh, the beds were comfortable and the A/C was awesome. Having our own pool was key to choosing a rental. The pool area is incredibly private and the pool temperature was perfect. It was also a great place to see a little wildlife. The proximity to the beach, restaurants, and shopping was very close. The communication with the management was great along with their recommendations for local activities. I can't say enough good things about staying at Flow. We'll definitely be back."
    },
    {
        "name": "Jeff",
        "property": "Casa Hermandad",
        "experience": "We just had an amazing week at Casa Hermandad in Nosara. The house not only is beautiful, but it sits on a very large lot that gives you an even better outside living experience. Our kids loved the two-level large swimming pool, ping pong table, and outdoor entertaining area. The house is only 2 blocks from the beach which was especially convenient since you didn't have to drive a car or golf cart to the beach. The thing that I would like to highlight the most about the property is actually Rick and Grace's customer service."
    },
    {
        "name": "Debra and Randy",
        "property": "Casa Almendra",
        "experience": "We stayed at Casa Almendra with our 5 adult children and significant others. It was a perfect house for us. Lots of community and private space. Quiet, comfortable beds, refreshing pool, and just a short walk to beach for our surfers. Grace, at property management was amazing at helping us rent cars, golf carts, arrange for groceries transportation, and chefs. Heidy, a talented chef made delicious dinners for us. She even made a special meal with the fresh yellowfin tuna our group brought back from a fishing trip. I highly recommend this house and this property management team."
    },
    {
        "name": "David",
        "property": "FLOW Main House",
        "experience": "Flow House was a fantastic place to stay. we were 5 people and we got unit F which is a 4 bedroom 5 bath with a pool. The service was lovely and the location is fantastic. Close to the restaurants and bars and close to the beach. I highly recommend a stay with them."
    },
    {
        "name": "Laura",
        "property": "FLOW Casita",
        "experience": "Nos encanto nuestra estadía en Villa de Flow Nosara. Excelente ubicación, se puede caminar a la playa y hay muchos restaurantes cerca. La casa rodeada de árboles y da la sensación de está inmerso en el bosque. Quedamos muy contentos con servicio de parte de Beach Management. La casa estaba muy limpia, super bien equipada, segura y con mucha privacidad hacia lo vecinos."
    },
    {
        "name": "Nancy T",
        "property": "Shanta Pura",
        "experience": "We recently stayed for a week in Shanta Piura and can't say enough positive things about this place!! Walking distance to the beach, amazing house all around - everything you see is what you get! We enjoyed the pool morning, noon, and night! We were two families so everybody had their own bed! Isa cooked for us breakfast lunch and dinner when we asked her to. Adolpho was also very friendly and very helpful! Daniella was in constant contact with us to ensure that we had everything that we needed."
    },
    {
        "name": "Heidi W",
        "property": "Shanta Pura",
        "experience": "We rented Shanta Pura for a week and it was amazing!! The house is beautiful!! Isa cooked lunch for us everyday. That was delightful, and her food was great! She even made a birthday cake for one of us!! Having the surf boards, bikes, beach chairs available was great, made it so easy for us to head to beach to play. The house is a short walk to the beach. Hope to rent this house again!!"
    },
    {
        "name": "Greg G",
        "property": "Shanta Pura",
        "experience": "Unbelievable home. Open air house! Bedrooms air conditioned! Truly beautiful. Beach 1 minute walk. It's like staying at a five star resort but better. Breakfast lunch dinner cooked for you while you swim in the pool inside the home! Great local restaurants friendly people and one of the greatest places to learn to surf. Slice of heaven. Can't wait to return! Well done boys well done."
    },
    {
        "name": "Missy H",
        "property": "Shanta Pura",
        "experience": "We had a girls week this January at Shanta Pura with six of us. What an incredible home to retreat to from our hectic lives. The layout of the house is so cool. The pool is the centerpiece with all the living areas opening up to the outside. Coming from cold temperatures at home, it was great to breathe the fresh air and soak up the sun. The decor and amenities are very high class and high end. You can tell the owners took great thought and care in how they decorated the house. The house is just a minute or two walk to the beach. It was easy to take early morning walks on the beach and take our beach chairs in the afternoon."
    },
    {
        "name": "Rick M.Shawnee",
        "property": "Shanta Pura",
        "experience": "We had a total of nine people with a mix of family and friends. The property was spectacular and we were very comfortable. We enjoyed hearing and watching the howler monkeys in the back yard. We went ziplining, horseback riding, surfing, bike riding on the beach, shopping, and enjoyed all of it. Fishing was terrible but that might be my luck. One of the best features of Shanta Pura is the cook, Isa, and the gardener, Rodolfo. Isa is a very talented cook and we had great meals. She was a joy to talk to as well. The pool was refreshing."
    },
    {
        "name": "Anne P",
        "property": "Shanta Pura",
        "experience": "Usually the pictures are just a little nicer than reality, but in this case, the house as a whole is so much more than the sum if it's pictures. The kitchen, dining room and game room surround a beautiful pool and courtyard, hacienda style, in such a way that 'inside' and 'outside' are blurred together. We had a fabulous thunderstorm where the courtyard turned into a box of rain. It was just so cool. We shared the house with another family, but also hosted two additional families for dinner a couple of nights, and the house easily absorbed us all. T"
    },
    {
        "name": "Adrienne H",
        "property": "Villa Belitza",
        "experience": "From start to finish, our best Nosara vacation yet! This home is spacious and stunning, both inside and out. The enchanting walk to the beach down the private path was such a bonus! It is in the best location one could as for, close to all. The newly renovated kitchens and bathrooms are spectacular, a beautiful space to enjoy with family and friends. We were thrilled to learn that Luz was the property manager, she is lovely and excellent at her job."
    },
    {
        "name": "Lambert B",
        "property": "Villa Belitza",
        "experience": "Just as described on the listing ! WE had a super great time at this property . Everything is easy ...surf in your backyard , café and restaurants nearby , spacious and clean house , nice pool and backyard , ...and everyday sunset at one minute walk . Don't forget to take the chez Luz will suggest you ...just incredible !!! This is a small paradise :))"
    },
    {
        "name": "Kris S",
        "property": "Villa Belitza",
        "experience": "Our two families of 4 and one grandmother had a fantastic stay at this wonderful property in Nosara! The house is spacious, extremely clean, the bathrooms are updated and it has separate air conditioning in each of the rooms. The outdoor space is remarkable! The pool is cleaned often and is just the right temperature to cool off. There is a long table where we spent many hours congregated around either playing cards or eating a delicious meal cooked by Graciela (highly, HIGHLY recommend her). There is shade and sun spots in this space and a very convenient and necessary outdoor shower."
    },
    {
        "name": "Paul",
        "property": "Buena Honda",
        "experience": "My wife and two girls stayed in the Buena Onda house for my 40th birthday. Kevin's house and the local property manager (Lily) completely exceeded our expectations, in every way. The house itself was incredible and the pictures online—while impressive in and of themselves—didn't do the actual space justice. You have to experience it yourself. After spending the week in Nosara, we found the house's actual location to be one of the most ideal in town (something I was unsure of when booking). It's at the end of a short street, off the busier main road, with private path access to the beach and easy walking distance to top restaurants/cafes. It was our first time to visit Nosara, but we all fell in love with it so much that we're already planning a return in a few months. Lily is the local property manager, who was always quick to respond. She arranged a private chef one night, the perfect day-long ATV excursion with waterfall visits, incredible mountain restaurant lunch, and helped us get oriented around town and the house throughout our stay. I highly recommend Nosara, this property, and the host team for delivering your next special experience in Costa Rica. Pura vida! 10/10"
    }
]